<?php

/* @var $this \yii\web\View */
/* @var $content string */

use app\models\Category;
use yii\bootstrap4\Html;
use yii\bootstrap4\Nav;
use yii\bootstrap4\NavBar;
use kartik\bs4dropdown\Dropdown;
use app\assets\AppAsset;
use app\widgets\Alert;

AppAsset::register($this);
$searchStr = Yii::$app->request->get('searchStr');
?>
<?php $this->beginPage() ?>
    <!DOCTYPE html>
    <html lang="<?= Yii::$app->language ?>">
    <head>
        <meta charset="<?= Yii::$app->charset ?>">
        <meta http-equiv="X-UA-Compatible" content="IE=edge">
        <meta name="viewport" content="width=device-width, initial-scale=1">
        <?php $this->registerCsrfMetaTags() ?>
        <title><?= Html::encode($this->title) ?></title>
        <?php $this->head() ?>
        <script src="https://kit.fontawesome.com/f74a7c5cc1.js" crossorigin="anonymous"></script>
    </head>
    <body>
    <?php $this->beginBody() ?>
    <div class="mobile-menu">
        <div id="mobileMenuHeader"><h6 class="mobile-menu__back">Назад</h6></div>
        <div id="mobileMenu"></div>
    </div>
    <div class="top-panel">
        <ul class="top-panel__list">
            <li class="top-panel__item"><a href="#" class="top-panel__link">Ссылка</a></li>
            <li class="top-panel__item"><a href="#" class="top-panel__link">Ссылка</a></li>
            <li class="top-panel__item"><a href="#" class="top-panel__link">Ссылка</a></li>
            <li class="top-panel__item"><a href="#" class="top-panel__link">Ссылка</a></li>
        </ul>
    </div>

    <header class="header">
        <div class="header__top">
            <div class="container-wrapper">
                <div class="header__top_location">
                    <span class="header__top_location_title">Местоположение:</span>
                    <a href="#" class="header__top_location_value" data-open-modal="location">
                        <svg width="16" height="16" viewBox="0 0 16 16"><path fill="currentColor" d="M3.812 6.883l2.556.852a3 3 0 0 1 1.897 1.897l.852 2.557 3.979-9.285-9.284 3.98zM15 1L9 15 7.316 9.949a2 2 0 0 0-1.265-1.265L1.001 7 15 1z"></path></svg>
                        <span>Москва</span>
                    </a>
                </div>
                <div class="header__top_menu">
                    <ul class="header__top_menu_list">
                        <li class="header__top_menu_item">
                            <a href="#" class="header__top_menu_link">
                                <svg width="16" height="16" viewBox="0 0 16 16"><path fill="currentColor" d="M7.5 14V9H3.263a7.02 7.02 0 0 1-.239-.004v3.594c0 .509.032.684.122.863a.76.76 0 0 0 .306.326c.17.096.333.221.811.221H7.5zm1 0h3.237c.478 0 .642-.125.81-.22a.754.754 0 0 0 .307-.327c.09-.18.122-.354.122-.863V8.996a7.02 7.02 0 0 1-.24.004H8.5v5zm0-6h4.237c.478 0 .642-.125.81-.22a.754.754 0 0 0 .307-.327c.09-.18.122-.354.122-.863v-.18c0-.509-.032-.684-.122-.863a.754.754 0 0 0-.306-.326c-.17-.096-.333-.221-.811-.221H3.263c-.478 0-.642.125-.81.22a.754.754 0 0 0-.307.327c-.09.18-.122.354-.122.863v.18c0 .509.032.684.122.863a.76.76 0 0 0 .306.326c.17.096.333.221.811.221H7.5V5h1v3zM3.263 4h-.162A2.118 2.118 0 0 1 3 3.333C3 2.045 3.98 1 5.188 1c.84 0 2.114.828 2.812 1.766C8.698 1.828 9.972 1 10.813 1 12.02 1 13 2.045 13 3.333c0 .245-.035.467-.1.667h-.163c.632 0 .956.067 1.294.259.311.177.56.441.726.773.18.36.243.705.243 1.378v.18c0 .673-.063 1.018-.243 1.378a1.814 1.814 0 0 1-.757.79v3.832c0 .673-.063 1.018-.243 1.378a1.814 1.814 0 0 1-.726.773c-.338.192-.662.259-1.294.259H4.263c-.632 0-.956-.067-1.294-.259a1.814 1.814 0 0 1-.726-.773c-.18-.36-.243-.705-.243-1.378V8.758a1.814 1.814 0 0 1-.757-.79C1.063 7.608 1 7.263 1 6.59v-.18c0-.673.063-1.018.243-1.378.167-.332.415-.596.726-.773C2.307 4.067 2.631 4 3.263 4zm.984 0H7.5c0-.643-1.56-2-2.313-2C4.548 2 4 2.583 4 3.333c0 .281.084.506.247.667zM8.5 4h3.253c.163-.161.247-.386.247-.667C12 2.583 11.453 2 10.812 2 10.06 2 8.5 3.357 8.5 4z"></path></svg>
                                <span>Промокод</span>
                            </a>
                        </li>
                        <li class="header__top_menu_item">
                            <a href="#" class="header__top_menu_link">
                                <svg width="16" height="16"><path d="M11 4H3.564c-.662 0-.864.039-1.07.149a.818.818 0 0 0-.345.346C2.039 4.7 2 4.902 2 5.564v.076L6.081 7H9.92L14 5.64v-.076c0-.662-.039-.864-.149-1.07a.818.818 0 0 0-.346-.345C13.3 4.039 13.098 4 12.436 4H11zM5.014 3c.031-.458.118-.724.253-.977.174-.326.43-.582.756-.756C6.35 1.093 6.696 1 7.446 1h1.108c.75 0 1.097.093 1.423.267.326.174.582.43.756.756.135.253.222.52.253.977h1.45c.892 0 1.215.093 1.54.267.327.174.583.43.757.756.174.326.267.65.267 1.54v5.873c0 .892-.093 1.215-.267 1.54a1.81 1.81 0 0 1-.756.757c-.326.174-.65.267-1.54.267H3.563c-.892 0-1.215-.093-1.54-.267a1.817 1.817 0 0 1-.757-.756c-.174-.326-.267-.65-.267-1.54V5.563c0-.892.093-1.215.267-1.54a1.81 1.81 0 0 1 .756-.757c.326-.174.65-.267 1.54-.267h1.45zm1.001 0h3.97a1.209 1.209 0 0 0-.134-.505.818.818 0 0 0-.346-.346C9.306 2.043 9.097 2 8.555 2h-1.11c-.542 0-.751.043-.95.149a.818.818 0 0 0-.346.346c-.07.132-.113.269-.134.505zM2 6.694v4.742c0 .662.039.864.149 1.07a.818.818 0 0 0 .346.345c.205.11.407.149 1.069.149h8.872c.662 0 .864-.039 1.07-.149a.818.818 0 0 0 .345-.346c.11-.205.149-.407.149-1.069V6.694l-3.842 1.28L10 8H6l-.158-.026L2 6.694zM10 8a2 2 0 1 1-4 0h1a1 1 0 1 0 2 0h1z" fill="currentColor" fill-rule="nonzero"></path></svg>
                                <span>Для бизнеса</span>
                            </a>
                        </li>
                        <li class="header__top_menu_item">
                            <a href="/lk/messages" class="header__top_menu_link">
                                <svg width="16" height="16" viewBox="0 0 16 16"><g fill="currentColor"><path d="M3.263 3c-.478 0-.642.125-.81.22a.754.754 0 0 0-.307.327c-.09.18-.122.354-.122.863v7.18c0 .509.032.684.122.863a.76.76 0 0 0 .306.326c.17.096.333.221.811.221h9.474c.478 0 .642-.125.81-.22a.754.754 0 0 0 .307-.327c.09-.18.122-.354.122-.863V4.41c0-.509-.032-.684-.122-.863a.754.754 0 0 0-.306-.326c-.17-.096-.333-.221-.811-.221H3.263zm0-1h9.474c.632 0 .956.067 1.294.259.311.177.56.441.726.773.18.36.243.705.243 1.378v7.18c0 .673-.063 1.018-.243 1.378a1.814 1.814 0 0 1-.726.773c-.338.192-.662.259-1.294.259H3.263c-.632 0-.956-.067-1.294-.259a1.814 1.814 0 0 1-.726-.773c-.18-.36-.243-.705-.243-1.378V4.41c0-.673.063-1.018.243-1.378.167-.332.415-.596.726-.773C2.307 2.067 2.631 2 3.263 2z"></path><path d="M12.168 4.533l.598.801L8 8.891 3.234 5.334l.598-.801L8 7.643z"></path></g></svg>
                                <span>Сообщения</span>
                            </a>
                        </li>
                        <li class="header__top_menu_item">
                            <a href="/lk/adverts/favorites" class="header__top_menu_link">
                                <svg width="16" height="16" viewBox="0 0 16 16"><path fill="currentColor" d="M8.333 3.906L8 4.204l-.333-.298c-.758-.679-1.562-1.073-2.334-1.073C3.4 2.833 2.167 4.067 2.167 6c0 2.597 2.127 4.988 5.816 7.175-.007-.004.043-.004.043-.004 3.69-2.21 5.807-4.583 5.807-7.171 0-1.933-1.233-3.167-3.166-3.167-.772 0-1.576.394-2.334 1.073zM8 2.88c.834-.659 1.736-1.047 2.667-1.047 2.485 0 4.166 1.682 4.166 4.167 0 3.044-2.328 5.655-6.286 8.024a1.08 1.08 0 0 1-1.083.006C3.508 11.685 1.167 9.053 1.167 6c0-2.485 1.681-4.167 4.166-4.167.931 0 1.833.388 2.667 1.047z"></path></svg>
                                <span>Избранное</span>
                            </a>
                        </li>
                        <li class="header__top_menu_item">
                            <a href="#" class="header__top_menu_link">
                                <svg width="16" height="16" viewBox="0 0 16 16"><path fill="currentColor" fill-rule="evenodd" d="M11.5 1c.828 0 1.5.504 1.5 1.125V3h.5A1.5 1.5 0 0 1 15 4.5v9a1.5 1.5 0 0 1-1.5 1.5H3a2 2 0 0 1-2-2V2.5C1 1.672 1.895 1 3 1h8.5zm2 3H2v9a1 1 0 0 0 1 1h10.5a.5.5 0 0 0 .5-.5V11h-2.857C9.959 11 9 10.105 9 9s.96-2 2.143-2H14V4.5a.5.5 0 0 0-.5-.5zm.5 4h-2.8c-.663 0-1.2.448-1.2 1s.537 1 1.2 1H14V8zm-2.5-6H2.67c-.552 0-.67.224-.67.5s.118.5.67.5H12v-.75c0-.138-.224-.25-.5-.25z"></path></svg>
                                <span>Кошелёк</span>
                            </a>
                        </li>
                    </ul>
                </div>
            </div>
        </div>
        <div class="header__content">
            <div class="container-wrapper">
                <div class="header__logo">
                    <a href="/" class="header__logo_link"><img src="/images/logo.png" alt="" class="header__logo_img"></a>
                </div>
                <div class="header__categories">
                    <a href="#" class="default_btn header__categories_btn">
                        <svg width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <line y1="0.5" x2="20" y2="0.5" stroke="currentColor"/>
                            <line y1="5.5" x2="16" y2="5.5" stroke="currentColor"/>
                            <line y1="10.5" x2="20" y2="10.5" stroke="currentColor"/>
                            <line y1="15.5" x2="12" y2="15.5" stroke="currentColor"/>
                        </svg>
                        <span>Категории</span>
                    </a>
                    <?php
                    echo Nav::widget([
                        'items' => [
                            [
                                'label' => 'Категории',
                                'items' => Category::makeDropList(),
                            ],
                        ],
                        'dropdownClass' => Dropdown::class, // use the custom dropdown
                        'options' => ['class' => 'navbar-nav'],
                    ]);
                    ?>
                </div>
                <div class="header__search">
                    <form class="header__search_form" action="/adverts/search">
                        <input type="text" class="header__search_query" name="searchStr" value="<?=$searchStr?>" placeholder="Поиск по объявлениям">
                        <input type="submit" class="default_btn header__search_btn" value="Найти">
                    </form>
                </div>
                <div class="header__options">
                    <a href="/lk/adverts/create" class="default_btn header__options_addoffer">Разместить объявление</a>
                    <?php if (Yii::$app->user->isGuest): ?>
                    <a href="/user/login" class="default_btn header__options_auth" data-open-modal="auth">Войти</a>
                    <?php else:?>
                    <a href="/user/logout" class="default_btn header__options_auth">Выйти</a>
                    <?php endif?>
                </div>
            </div>
        </div>
    </header>

    <div class="content_page">
        <?= Alert::widget() ?>
        <?= $content ?>
    </div>

    <footer class="footer">
        <div class="container-wrapper">
            <div class="footer__content">
                <ul class="location-list">
                    <li class="location-list__item"><a href="#" class="location-list__link">Москва</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Санкт-Петербург</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Екатеринбург</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Москва</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Санкт-Петербург</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Екатеринбург</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Москва</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Санкт-Петербург</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Екатеринбург</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Москва</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Санкт-Петербург</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Екатеринбург</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Москва</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Санкт-Петербург</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Екатеринбург</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Москва</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Санкт-Петербург</a></li>
                    <li class="location-list__item"><a href="#" class="location-list__link">Екатеринбург</a></li>
                </ul>
                <div class="footer__block footer__block_menu">
                    <ul class="footer-menu">
                        <li class="footer-menu__item"><a href="#" class="footer-menu__link">Лицензионное соглашение</a></li>
                        <li class="footer-menu__item"><a href="#" class="footer-menu__link">Помощь</a></li>
                        <li class="footer-menu__item"><a href="#" class="footer-menu__link">Реклама на Юле</a></li>
                    </ul>
                </div>
                <div class="footer__block footer__block_social">
                    <h4 class="footer__block_title">Юла в социальных сетях</h4>
                    <ul class="sidebar-social__list">
                        <li class="sidebar-social__item">
                            <a href="#" class="sidebar-social__link _vk">
                                <svg width="32" height="32" viewBox="0 0 32 32" fill="currentColor"><path fill-rule="evenodd" d="M22.153 18.052s1.415 1.396 1.764 2.045c.01.013.015.026.018.033.142.238.175.423.105.562-.117.23-.517.343-.653.353h-2.5c-.174 0-.537-.045-.977-.348-.338-.237-.672-.625-.997-1.004-.485-.563-.905-1.05-1.328-1.05a.508.508 0 0 0-.158.025c-.32.104-.73.56-.73 1.777 0 .38-.3.598-.512.598H15.04c-.39 0-2.422-.136-4.222-2.035-2.203-2.325-4.186-6.988-4.203-7.031-.125-.302.133-.464.415-.464h2.525c.337 0 .447.205.523.387.09.212.42 1.053.962 2 .878 1.543 1.417 2.17 1.848 2.17a.5.5 0 0 0 .232-.06c.563-.313.458-2.322.433-2.738 0-.079-.001-.899-.29-1.292-.206-.285-.558-.393-.771-.433a.918.918 0 0 1 .331-.282c.387-.193 1.084-.222 1.775-.222h.385c.75.01.944.059 1.215.127.55.132.562.487.514 1.702-.015.345-.03.735-.03 1.195 0 .1-.005.206-.005.32-.017.618-.037 1.32.4 1.608a.36.36 0 0 0 .19.055c.151 0 .608 0 1.845-2.122a16.19 16.19 0 0 0 .991-2.123c.025-.043.099-.177.185-.228a.443.443 0 0 1 .207-.049h2.968c.324 0 .545.049.587.174.073.198-.013.803-1.368 2.638l-.605.798c-1.229 1.61-1.229 1.692.076 2.914z"></path></svg>
                            </a>
                        </li>
                        <li class="sidebar-social__item">
                            <a href="#" class="sidebar-social__link _ok">
                                <svg width="32" height="32" viewBox="0 0 32 32" fill="currentColor"><path d="M15.946 16.395c-2.544-.01-4.592-2.09-4.582-4.645.01-2.557 2.074-4.658 4.623-4.686 2.567-.028 4.66 2.059 4.648 4.65-.013 2.593-2.122 4.692-4.689 4.681zm.028-6.595a1.948 1.948 0 0 0-1.922 1.94 1.912 1.912 0 0 0 1.907 1.924 1.948 1.948 0 0 0 1.932-1.94A1.908 1.908 0 0 0 15.974 9.8zm4.669 9.678a8.876 8.876 0 0 1-2.491 1.047l2.23 2.268c.493.501.49 1.303-.008 1.788a1.26 1.26 0 0 1-1.782-.03l-2.615-2.67-2.615 2.586c-.243.24-.41.279-.559.344l-.316.008a1.23 1.23 0 0 1-.87-.38 1.255 1.255 0 0 1 .005-1.762l2.193-2.182a8.766 8.766 0 0 1-2.489-1.095 1.398 1.398 0 0 1-.422-1.91 1.357 1.357 0 0 1 1.89-.424 5.98 5.98 0 0 0 6.367.027 1.403 1.403 0 1 1 1.482 2.385z" fill-rule="evenodd"></path></svg>
                            </a>
                        </li>
                        <li class="sidebar-social__item">
                            <a href="#" class="sidebar-social__link _facebook">
                                <svg width="32" height="32" viewBox="0 0 32 32" fill="currentColor"><path fill-rule="evenodd" d="M19.79 11.057h-2.405c-.285 0-.602.375-.602.873v1.737h3.009l-.455 2.476h-2.554v7.435h-2.838v-7.435H11.37v-2.476h2.575V12.21c0-2.09 1.45-3.788 3.44-3.788h2.405v2.635z"></path></svg>
                            </a>
                        </li>
                        <li class="sidebar-social__item">
                            <a href="#" class="sidebar-social__link _twitter">
                                <svg width="32" height="32" viewBox="0 0 32 32" fill="currentColor"><path fill-rule="evenodd" d="M22.508 13.107c.007.136.009.273.009.406 0 4.167-3.169 8.969-8.965 8.969-1.78 0-3.437-.52-4.83-1.417.245.03.496.042.751.042a6.311 6.311 0 0 0 3.914-1.349 3.158 3.158 0 0 1-2.944-2.186 3.166 3.166 0 0 0 1.422-.055 3.154 3.154 0 0 1-2.528-3.09v-.039a3.16 3.16 0 0 0 1.428.395 3.15 3.15 0 0 1-1.402-2.625c0-.576.155-1.12.427-1.585a8.96 8.96 0 0 0 6.495 3.295 3.152 3.152 0 0 1 5.37-2.875 6.33 6.33 0 0 0 2-.765 3.166 3.166 0 0 1-1.385 1.745 6.33 6.33 0 0 0 1.81-.498 6.39 6.39 0 0 1-1.572 1.632z"></path></svg>
                            </a>
                        </li>
                        <li class="sidebar-social__item">
                            <a href="#" class="sidebar-social__link _youtube">
                                <svg width="32" height="32" viewBox="0 0 32 32" fill="currentColor"><path d="M16 0c8.837 0 16 7.163 16 16s-7.163 16-16 16S0 24.837 0 16 7.163 0 16 0zm9.12 11.852a2.4 2.4 0 0 0-1.69-1.699c-1.492-.401-7.47-.401-7.47-.401s-5.98 0-7.47.401a2.4 2.4 0 0 0-1.69 1.699c-.4 1.498-.4 4.624-.4 4.624s0 3.126.4 4.624a2.4 2.4 0 0 0 1.69 1.698c1.49.402 7.47.402 7.47.402s5.978 0 7.47-.402a2.4 2.4 0 0 0 1.69-1.698c.399-1.498.399-4.624.399-4.624s0-3.126-.4-4.624z"></path><path d="M14.048 19.358l4.967-2.882-4.967-2.882v5.764"></path></svg>
                            </a>
                        </li>
                    </ul>
                </div>
                <div class="footer__block footer__block_app">
                    <h4 class="footer__block_title">Мобильное приложение Юла</h4>
                    <ul class="app-download__list">
                        <li class="app-download__item">
                            <a href="#" class="app-download__link _appstore">
                                <svg width="135" height="40" viewBox="0 0 135 40"><g fill="none" fill-rule="evenodd"><rect width="134" height="39" x="0.5" y="0.5" fill="#000" stroke="#A6A6A6" rx="4"></rect><g fill="#FFF" fill-rule="nonzero"><path d="M30.128 19.784c-.029-3.223 2.639-4.791 2.761-4.864-1.511-2.203-3.853-2.504-4.676-2.528-1.967-.207-3.875 1.177-4.877 1.177-1.022 0-2.565-1.157-4.228-1.123-2.14.033-4.142 1.272-5.24 3.196-2.266 3.923-.576 9.688 1.595 12.859 1.086 1.553 2.355 3.287 4.016 3.226 1.625-.067 2.232-1.036 4.193-1.036 1.943 0 2.513 1.036 4.207.997 1.744-.028 2.842-1.56 3.89-3.127 1.255-1.78 1.759-3.533 1.779-3.623-.041-.014-3.387-1.291-3.42-5.154zm-3.2-9.478c.874-1.093 1.472-2.58 1.306-4.089-1.265.056-2.847.875-3.758 1.944-.806.942-1.526 2.486-1.34 3.938 1.421.106 2.88-.717 3.792-1.793zm26.717 21.198h-2.271l-1.244-3.909h-4.324l-1.185 3.909H42.41l4.284-13.308h2.646l4.305 13.308zm-3.89-5.549L48.63 22.48c-.119-.355-.342-1.191-.671-2.507h-.04a96.75 96.75 0 0 1-.632 2.507l-1.105 3.475h3.573zm14.907.633c0 1.632-.441 2.922-1.323 3.869-.79.843-1.771 1.264-2.942 1.264-1.264 0-2.172-.454-2.725-1.362h-.04v5.055H55.5V25.067c0-1.026-.027-2.079-.079-3.159h1.875l.119 1.521h.04c.711-1.146 1.79-1.718 3.238-1.718 1.132 0 2.077.447 2.833 1.342.758.896 1.136 2.074 1.136 3.535zm-2.172.078c0-.934-.21-1.704-.632-2.31-.461-.632-1.08-.948-1.856-.948-.526 0-1.004.176-1.431.523-.428.35-.708.807-.839 1.373-.066.264-.099.48-.099.65v1.6c0 .698.214 1.287.642 1.768.428.481.984.721 1.668.721.803 0 1.428-.31 1.875-.928.448-.619.672-1.435.672-2.449zm13.209-.078c0 1.632-.441 2.922-1.324 3.869-.789.843-1.77 1.264-2.941 1.264-1.264 0-2.172-.454-2.724-1.362h-.04v5.055h-2.132V25.067c0-1.026-.027-2.079-.079-3.159h1.875l.119 1.521h.04c.71-1.146 1.789-1.718 3.238-1.718 1.131 0 2.076.447 2.834 1.342.755.896 1.134 2.074 1.134 3.535zm-2.172.078c0-.934-.211-1.704-.633-2.31-.461-.632-1.078-.948-1.855-.948a2.22 2.22 0 0 0-1.432.523c-.428.35-.707.807-.838 1.373-.065.264-.099.48-.099.65v1.6c0 .698.214 1.287.64 1.768.428.48.984.721 1.67.721.803 0 1.428-.31 1.875-.928.448-.619.672-1.435.672-2.449zm14.512 1.106c0 1.132-.393 2.053-1.182 2.764-.867.777-2.074 1.165-3.625 1.165-1.432 0-2.58-.276-3.449-.829l.494-1.777c.936.566 1.963.85 3.082.85.803 0 1.428-.182 1.877-.544.447-.362.67-.848.67-1.454 0-.54-.184-.995-.553-1.364-.367-.369-.98-.712-1.836-1.029-2.33-.869-3.494-2.142-3.494-3.816 0-1.094.408-1.991 1.225-2.689.814-.699 1.9-1.048 3.258-1.048 1.211 0 2.217.211 3.02.632l-.533 1.738c-.75-.408-1.598-.612-2.547-.612-.75 0-1.336.185-1.756.553a1.58 1.58 0 0 0-.533 1.205c0 .526.203.961.611 1.303.355.316 1 .658 1.936 1.027 1.145.461 1.986 1 2.527 1.618.539.616.808 1.387.808 2.307zm7.049-4.264h-2.35v4.659c0 1.185.414 1.777 1.244 1.777.381 0 .697-.033.947-.099l.059 1.619c-.42.157-.973.236-1.658.236-.842 0-1.5-.257-1.975-.77-.473-.514-.711-1.376-.711-2.587v-4.837h-1.4v-1.6h1.4v-1.757l2.094-.632v2.389h2.35v1.602zm10.603 3.119c0 1.475-.422 2.686-1.264 3.633-.883.975-2.055 1.461-3.516 1.461-1.408 0-2.529-.467-3.365-1.401-.836-.934-1.254-2.113-1.254-3.534 0-1.487.43-2.705 1.293-3.652.861-.948 2.023-1.422 3.484-1.422 1.408 0 2.541.467 3.396 1.402.818.907 1.226 2.078 1.226 3.513zm-2.212.069c0-.885-.189-1.644-.572-2.277-.447-.766-1.086-1.148-1.914-1.148-.857 0-1.508.383-1.955 1.148-.383.634-.572 1.405-.572 2.317 0 .885.189 1.644.572 2.276.461.766 1.105 1.148 1.936 1.148.814 0 1.453-.39 1.914-1.168.393-.645.591-1.412.591-2.296zm9.142-2.913a3.702 3.702 0 0 0-.672-.059c-.75 0-1.33.283-1.738.85-.355.5-.533 1.132-.533 1.895v5.035h-2.131l.02-6.574c0-1.106-.027-2.113-.08-3.021h1.857l.078 1.836h.059c.225-.631.58-1.139 1.066-1.52a2.578 2.578 0 0 1 1.541-.514c.197 0 .375.014.533.039v2.033zm9.535 2.469a5 5 0 0 1-.078.967h-6.396c.025.948.334 1.673.928 2.173.539.447 1.236.671 2.092.671.947 0 1.811-.151 2.588-.454l.334 1.48c-.908.396-1.98.593-3.217.593-1.488 0-2.656-.438-3.506-1.313-.848-.875-1.273-2.05-1.273-3.524 0-1.447.395-2.652 1.186-3.613.828-1.026 1.947-1.539 3.355-1.539 1.383 0 2.43.513 3.141 1.539.563.815.846 1.823.846 3.02zm-2.033-.553c.014-.632-.125-1.178-.414-1.639-.369-.593-.936-.889-1.699-.889-.697 0-1.264.289-1.697.869-.355.461-.566 1.014-.631 1.658h4.441v.001zM43.424 7.273c.227-.136.483-.25.771-.344a3.267 3.267 0 0 1 1.014-.141c.627 0 1.121.149 1.483.446.362.297.543.698.543 1.203 0 .401-.121.737-.363 1.009a1.757 1.757 0 0 1-.927.543v.029c.207.033.403.089.587.17.185.081.347.189.485.325a1.471 1.471 0 0 1 .451 1.078c0 .362-.073.666-.219.912a1.83 1.83 0 0 1-.572.602 2.403 2.403 0 0 1-.79.334 3.882 3.882 0 0 1-.873.102c-.311 0-.618-.033-.922-.097a2.863 2.863 0 0 1-.844-.32l.262-.805c.168.084.385.165.65.243.265.078.533.116.805.116.446 0 .791-.1 1.033-.3a.994.994 0 0 0 .364-.805.987.987 0 0 0-.146-.558 1.064 1.064 0 0 0-.379-.345 1.655 1.655 0 0 0-.519-.174 3.43 3.43 0 0 0-.567-.049h-.437V9.65h.437c.2 0 .386-.025.558-.078.171-.051.32-.124.446-.218s.225-.206.296-.335a.903.903 0 0 0 .106-.437c0-.291-.104-.519-.311-.684-.207-.165-.485-.248-.834-.248-.239 0-.479.039-.718.116a5.295 5.295 0 0 0-.641.252l-.229-.745zm8.331 6.16l-.077-.543h-.029c-.316.433-.775.65-1.377.65-.214 0-.407-.036-.582-.107a1.435 1.435 0 0 1-.456-.291 1.285 1.285 0 0 1-.301-.437 1.408 1.408 0 0 1-.106-.553c0-.588.239-1.03.718-1.324.479-.294 1.157-.441 2.037-.441V10.3c0-.621-.326-.931-.978-.931-.465 0-.875.117-1.229.349l-.213-.688c.433-.271.972-.407 1.617-.407 1.233 0 1.85.65 1.85 1.95v1.736c0 .485.023.86.068 1.125h-.942v-.001zm-.145-2.347c-.585 0-1.021.074-1.307.223-.286.149-.429.392-.429.728 0 .246.067.43.202.553a.731.731 0 0 0 .512.184 1.05 1.05 0 0 0 .708-.272.988.988 0 0 0 .228-.306.866.866 0 0 0 .086-.383v-.727zm6.073-2.367v.863h-1.96v3.851h-1.047V8.719zm5.994 2.299c0 .375-.052.718-.155 1.028a2.39 2.39 0 0 1-.432.795 1.932 1.932 0 0 1-1.508.699c-.621 0-1.067-.223-1.339-.669h-.02v2.483h-1.048v-5.083a38.698 38.698 0 0 0-.038-1.553h.921l.059.747h.02c.349-.562.879-.844 1.591-.844.277 0 .535.058.771.174.236.117.441.28.616.49.175.21.312.462.412.757.1.295.15.62.15.976zm-1.066.039c0-.233-.028-.448-.083-.645a1.477 1.477 0 0 0-.242-.504 1.183 1.183 0 0 0-.388-.33 1.067 1.067 0 0 0-.51-.121c-.148 0-.294.033-.437.097a1.187 1.187 0 0 0-.373.262c-.107.11-.192.243-.257.398-.065.155-.098.32-.098.495v.786c0 .174.027.336.083.485.055.149.132.278.232.388.1.11.22.196.359.257.139.062.292.092.46.092.395 0 .702-.15.922-.451.22-.301.332-.705.332-1.209zm6.694-2.338l-1.194 3.269c-.284.776-.561 1.411-.829 1.906-.269.495-.525.855-.771 1.082-.362.323-.747.521-1.155.591l-.252-.882c.271-.071.53-.21.776-.417.245-.207.442-.465.592-.776a.594.594 0 0 0 .077-.213.88.88 0 0 0-.058-.223L64.783 8.72h1.154l.893 2.629c.046.123.091.262.136.417.046.155.094.327.146.514h.02a6.41 6.41 0 0 0 .106-.393c.039-.158.091-.341.155-.548l.796-2.619h1.116v-.001zm1.814 1.959h.484c.355 0 .631-.064.824-.194.193-.13.291-.288.291-.476a.54.54 0 0 0-.248-.465c-.164-.116-.393-.175-.684-.175-.188 0-.377.031-.566.092a2.98 2.98 0 0 0-.529.228l-.271-.678a2.9 2.9 0 0 1 .811-.305 4.01 4.01 0 0 1 .809-.083c.215 0 .43.021.646.063.215.042.408.113.576.213.168.1.307.231.412.393.107.162.16.362.16.602 0 .149-.029.28-.088.393a1.017 1.017 0 0 1-.232.3 1.254 1.254 0 0 1-.324.213 1.743 1.743 0 0 1-.363.122v.029c.154.02.305.059.451.117.145.058.275.134.393.228.115.094.209.207.281.339.07.133.105.283.105.451 0 .278-.066.511-.203.698a1.46 1.46 0 0 1-.52.446 2.51 2.51 0 0 1-.693.238 3.938 3.938 0 0 1-1.599-.019 2.71 2.71 0 0 1-.768-.286l.273-.689c.168.091.359.167.576.228.217.061.438.092.664.092.355 0 .629-.069.82-.208.189-.139.285-.312.285-.519a.588.588 0 0 0-.096-.344.71.71 0 0 0-.271-.228 1.33 1.33 0 0 0-.408-.121 3.444 3.444 0 0 0-.504-.034h-.494v-.661zm5.596-1.959v1.668c0 .382-.006.725-.02 1.028-.014.304-.029.624-.049.96l.02.019.363-.723c.121-.236.242-.477.365-.723l1.164-2.231h1.357v4.714h-.99v-1.668c0-.349.01-.698.025-1.047.016-.35.033-.702.053-1.058h-.049a6.95 6.95 0 0 1-.33.757c-.109.213-.219.433-.328.66-.201.388-.4.776-.598 1.164-.197.388-.406.786-.625 1.193h-1.357V8.719h.999zm8.73 0v.863H84.01v3.851h-1.03V9.582h-1.426v-.863zm5.344 2.134c0 .09-.004.176-.01.257a1.753 1.753 0 0 1-.029.218h-3.143c.014.446.154.791.422 1.033.268.242.623.364 1.062.364.459 0 .883-.074 1.271-.223l.164.728c-.447.194-.973.291-1.582.291-.367 0-.697-.057-.988-.17a2.044 2.044 0 0 1-.738-.48 2.12 2.12 0 0 1-.461-.747 2.868 2.868 0 0 1-.158-.979c0-.362.053-.697.158-1.004.107-.307.258-.574.451-.8.195-.227.43-.404.703-.534.275-.129.582-.194.918-.194a2 2 0 0 1 .811.16c.242.106.449.258.619.456.172.197.303.434.393.708.092.274.137.58.137.916zm-1-.271c0-.369-.088-.668-.266-.897-.178-.229-.435-.345-.771-.345a1.01 1.01 0 0 0-.775.349c-.213.233-.336.53-.369.893h2.181zm5.221-1.824c.188-.032.426-.058.717-.078.291-.02.588-.029.893-.029.193 0 .412.012.654.034.242.022.475.074.693.155.221.081.404.202.553.364.149.162.225.381.225.659a.916.916 0 0 1-.287.679 1.155 1.155 0 0 1-.301.208c-.113.055-.23.096-.354.121l.01.029c.342.058.621.181.834.369.213.188.32.446.32.776s-.092.592-.271.786c-.182.194-.404.34-.67.437a3.277 3.277 0 0 1-.84.185 9.444 9.444 0 0 1-.789.039c-.26 0-.514-.006-.762-.02-.25-.013-.457-.026-.625-.039V8.758zm1.008 1.882h.533c.162 0 .316-.011.461-.034.146-.022.273-.058.383-.106a.647.647 0 0 0 .258-.194.477.477 0 0 0 .092-.296.5.5 0 0 0-.268-.47c-.178-.1-.457-.15-.838-.15-.109 0-.205.003-.287.01l-.334.029v1.211zm0 2.085c.129.013.238.022.324.029a3.925 3.925 0 0 0 .743-.019 1.45 1.45 0 0 0 .408-.111.75.75 0 0 0 .295-.222.58.58 0 0 0 .113-.371c0-.27-.121-.456-.359-.559-.24-.103-.562-.154-.971-.154h-.553v1.407z"></path></g></g></svg>
                            </a>
                        </li>
                        <li class="app-download__item">
                            <a href="#" class="app-download__link _googleplay">
                                <svg width="135" height="40" viewBox="0 0 135 40"><defs><linearGradient id="google-play_svg__a" x1="91.536%" x2="-37.559%" y1="4.839%" y2="71.968%"><stop offset="0%" stop-color="#00A0FF"></stop><stop offset=".657%" stop-color="#00A1FF"></stop><stop offset="26.01%" stop-color="#00BEFF"></stop><stop offset="51.22%" stop-color="#00D2FF"></stop><stop offset="76.04%" stop-color="#00DFFF"></stop><stop offset="100%" stop-color="#00E3FF"></stop></linearGradient><linearGradient id="google-play_svg__b" x1="107.728%" x2="-130.665%" y1="49.428%" y2="49.428%"><stop offset="0%" stop-color="#FFE000"></stop><stop offset="40.87%" stop-color="#FFBD00"></stop><stop offset="77.54%" stop-color="orange"></stop><stop offset="100%" stop-color="#FF9C00"></stop></linearGradient><linearGradient id="google-play_svg__c" x1="86.389%" x2="-49.888%" y1="17.815%" y2="194.393%"><stop offset="0%" stop-color="#FF3A44"></stop><stop offset="100%" stop-color="#C31162"></stop></linearGradient><linearGradient id="google-play_svg__d" x1="-18.579%" x2="42.275%" y1="-54.527%" y2="24.69%"><stop offset="0%" stop-color="#32A071"></stop><stop offset="6.85%" stop-color="#2DA771"></stop><stop offset="47.62%" stop-color="#15CF74"></stop><stop offset="80.09%" stop-color="#06E775"></stop><stop offset="100%" stop-color="#00F076"></stop></linearGradient></defs><g fill="none" fill-rule="evenodd"><rect width="134" height="39" x="0.5" y="0.5" fill="#000" stroke="#A6A6A6" rx="4"></rect><g fill-rule="nonzero"><path fill="#FFF" d="M68.1 21.8c-2.4 0-4.3 1.8-4.3 4.3 0 2.4 1.9 4.3 4.3 4.3s4.3-1.8 4.3-4.3c0-2.6-1.9-4.3-4.3-4.3zm0 6.8c-1.3 0-2.4-1.1-2.4-2.6s1.1-2.6 2.4-2.6c1.3 0 2.4 1 2.4 2.6 0 1.5-1.1 2.6-2.4 2.6zm-9.3-6.8c-2.4 0-4.3 1.8-4.3 4.3 0 2.4 1.9 4.3 4.3 4.3s4.3-1.8 4.3-4.3c0-2.6-1.9-4.3-4.3-4.3zm0 6.8c-1.3 0-2.4-1.1-2.4-2.6s1.1-2.6 2.4-2.6c1.3 0 2.4 1 2.4 2.6 0 1.5-1.1 2.6-2.4 2.6zm-11.1-5.5v1.8H52c-.1 1-.5 1.8-1 2.3-.6.6-1.6 1.3-3.3 1.3-2.7 0-4.7-2.1-4.7-4.8 0-2.7 2.1-4.8 4.7-4.8 1.4 0 2.5.6 3.3 1.3l1.3-1.3c-1.1-1-2.5-1.8-4.5-1.8-3.6 0-6.7 3-6.7 6.6 0 3.6 3.1 6.6 6.7 6.6 2 0 3.4-.6 4.6-1.9 1.2-1.2 1.6-2.9 1.6-4.2 0-.4 0-.8-.1-1.1h-6.2zm45.4 1.4c-.4-1-1.4-2.7-3.6-2.7s-4 1.7-4 4.3c0 2.4 1.8 4.3 4.2 4.3 1.9 0 3.1-1.2 3.5-1.9l-1.4-1c-.5.7-1.1 1.2-2.1 1.2s-1.6-.4-2.1-1.3l5.7-2.4-.2-.5zm-5.8 1.4c0-1.6 1.3-2.5 2.2-2.5.7 0 1.4.4 1.6.9l-3.8 1.6zM82.6 30h1.9V17.5h-1.9V30zm-3-7.3c-.5-.5-1.3-1-2.3-1-2.1 0-4.1 1.9-4.1 4.3s1.9 4.2 4.1 4.2c1 0 1.8-.5 2.2-1h.1v.6c0 1.6-.9 2.5-2.3 2.5-1.1 0-1.9-.8-2.1-1.5l-1.6.7c.5 1.1 1.7 2.5 3.8 2.5 2.2 0 4-1.3 4-4.4V22h-1.8v.7zm-2.2 5.9c-1.3 0-2.4-1.1-2.4-2.6s1.1-2.6 2.4-2.6c1.3 0 2.3 1.1 2.3 2.6s-1 2.6-2.3 2.6zm24.4-11.1h-4.5V30h1.9v-4.7h2.6c2.1 0 4.1-1.5 4.1-3.9s-2-3.9-4.1-3.9zm.1 6h-2.7v-4.3h2.7c1.4 0 2.2 1.2 2.2 2.1-.1 1.1-.9 2.2-2.2 2.2zm11.5-1.8c-1.4 0-2.8.6-3.3 1.9l1.7.7c.4-.7 1-.9 1.7-.9 1 0 1.9.6 2 1.6v.1c-.3-.2-1.1-.5-1.9-.5-1.8 0-3.6 1-3.6 2.8 0 1.7 1.5 2.8 3.1 2.8 1.3 0 1.9-.6 2.4-1.2h.1v1h1.8v-4.8c-.2-2.2-1.9-3.5-4-3.5zm-.2 6.9c-.6 0-1.5-.3-1.5-1.1 0-1 1.1-1.3 2-1.3.8 0 1.2.2 1.7.4-.2 1.2-1.2 2-2.2 2zm10.5-6.6l-2.1 5.4h-.1l-2.2-5.4h-2l3.3 7.6-1.9 4.2h1.9l5.1-11.8h-2zm-16.8 8h1.9V17.5h-1.9V30z"></path><path fill="url(#google-play_svg__a)" d="M1.4.5c-.3.3-.5.8-.5 1.4V24c0 .6.2 1.1.5 1.4l.1.1 12.4-12.4v-.2L1.4.5z" transform="translate(9 7)"></path><path fill="url(#google-play_svg__b)" d="M18 17.3l-4.1-4.1v-.3L18 8.8l.1.1 4.9 2.8c1.4.8 1.4 2.1 0 2.9l-5 2.7z" transform="translate(9 7)"></path><path fill="url(#google-play_svg__c)" d="M18.1 17.2L13.9 13 1.4 25.5c.5.5 1.2.5 2.1.1l14.6-8.4" transform="translate(9 7)"></path><path fill="url(#google-play_svg__d)" d="M18.1 8.8L3.5.5C2.6 0 1.9.1 1.4.6L13.9 13l4.2-4.2z" transform="translate(9 7)"></path><g fill="#000"><path d="M27 24.1l-14.5 8.2c-.8.5-1.5.4-2 0l-.1.1.1.1c.5.4 1.2.5 2 0L27 24.1z" opacity="0.2"></path><path d="M10.4 32.3c-.3-.3-.4-.8-.4-1.4v.1c0 .6.2 1.1.5 1.4v-.1h-.1z" opacity="0.12"></path></g><path fill="#000" d="M32 21.3l-5 2.8.1.1 4.9-2.8c.7-.4 1-.9 1-1.4 0 .5-.4.9-1 1.3z" opacity="0.12"></path><path fill="#FFF" d="M12.5 7.6L32 18.7c.6.4 1 .8 1 1.3 0-.5-.3-1-1-1.4L12.5 7.5C11.1 6.7 10 7.4 10 9v.1c0-1.6 1.1-2.3 2.5-1.5z" opacity="0.25"></path><path d="M42.1 14.3h-.7v-2h.6c.5-.4.8-1.2.8-2.3V7h4v5.3h.7v2h-.7V13h-4.6v1.3h-.1zm1.4-4.3c0 .9-.2 1.7-.6 2.3h3V7.8h-2.5V10h.1zm9.9 2.2c-.6.6-1.3.9-2.2.9-.9 0-1.6-.3-2.2-.9-.6-.6-.9-1.3-.9-2.2 0-.9.3-1.6.9-2.2.6-.6 1.3-.9 2.2-.9.9 0 1.6.3 2.2.9.6.6.9 1.3.9 2.2 0 .9-.3 1.6-.9 2.2zm-3.8-.5c.4.4 1 .7 1.6.7.6 0 1.2-.2 1.6-.7.4-.4.7-1 .7-1.7s-.2-1.3-.7-1.7c-.4-.4-1-.7-1.6-.7-.6 0-1.2.2-1.6.7-.4.4-.7 1-.7 1.7s.2 1.3.7 1.7zm8.6 1.4c-.9 0-1.6-.3-2.2-.9-.6-.6-.9-1.3-.9-2.2 0-.9.3-1.6.9-2.2.6-.6 1.3-.9 2.2-.9.9 0 1.6.3 2.2 1l-.5.5c-.4-.5-1-.8-1.7-.8s-1.2.2-1.7.7c-.5.4-.7 1-.7 1.7s.2 1.3.7 1.7c.4.4 1 .7 1.7.7s1.3-.3 1.8-.9l.5.5c-.3.3-.6.6-1 .8-.4.2-.8.3-1.3.3zm5.5-.1h-.8V7.7h-1.7V7h4.1v.7h-1.7V13zm6.9-6l-2.3 5.1c-.3.7-.8 1.1-1.4 1.1-.2 0-.4 0-.6-.1l.2-.7c.1.1.3.1.4.1.2 0 .3 0 .4-.1.1-.1.2-.2.3-.4l.2-.5-2-4.4h.9l1.5 3.4 1.4-3.4h1V7zm.9 6V7h4.3v6H75V7.7h-2.8V13zm5.7 0V7h.8v2.6h3V7h.8v6H81v-2.7h-3V13zm10.9-.8c-.6.6-1.3.9-2.2.9-.9 0-1.6-.3-2.2-.9-.6-.6-.9-1.3-.9-2.2 0-.9.3-1.6.9-2.2.6-.6 1.3-.9 2.2-.9.9 0 1.6.3 2.2.9.6.6.9 1.3.9 2.2-.1.9-.4 1.6-.9 2.2zm-3.9-.5c.4.4 1 .7 1.6.7.6 0 1.2-.2 1.6-.7.4-.4.7-1 .7-1.7s-.2-1.3-.7-1.7c-.4-.4-1-.7-1.6-.7-.6 0-1.2.2-1.6.7a2.413 2.413 0 0 0 0 3.4zm7.9 1.3V7h2.2c.5 0 .9.2 1.2.5.3.3.5.7.5 1.2 0 .3-.1.5-.2.8-.1.2-.3.4-.6.5.3.1.5.3.7.5.2.2.3.5.3.9 0 .5-.2.9-.5 1.2-.4.3-.8.5-1.3.5h-2.3V13zm.8-3.4h1.4c.3 0 .5-.1.7-.3.2-.2.3-.4.3-.6 0-.2-.1-.4-.3-.6-.2-.2-.4-.3-.7-.3h-1.4v1.8zm0 2.7h1.6c.3 0 .5-.1.7-.3.2-.2.3-.4.3-.7 0-.2-.1-.5-.3-.7-.2-.2-.4-.3-.7-.3H93v2h-.1z" fill="#FFF" stroke="#FFF" stroke-width="0.2"></path></g></g></svg>
                            </a>
                        </li>
                    </ul>
                </div>
                <div class="footer__block footer__block_copyright">
                    <h4 class="footer__block_title">© 2022 Mail.ru Group</h4>
                </div>
            </div>
        </div>
    </footer>
    <div class="modal-popup__bg" style="display: none;"></div>
    <div class="modal-popup modal-location" style="display: none;" id="location">
        <div class="modal-popup__content">
            <a class="modal-popup__close"></a>
            <div class="modal-location__content">
                <div class="default-tabs">
                    <ul class="nav default-nav-tabs" role="tablist">
                        <li class="default-nav-item"><a class="default-nav-link active" data-toggle="tab" href="#tab-location" role="tab">Местоположение</a></li>
                        <li class="default-nav-item"><a class="default-nav-link" data-toggle="tab" href="#tab-city" role="tab">Город</a></li>
                    </ul>
                </div>
                <div class="tab-content">
                    <div class="tab-pane active" id="tab-location">
                        <div id="map_location" class="modal-location__map"></div>
                        <div class="modal-location__groupbtn">
                            <a href="#" class="modal-location__groupbtn_cancel _modal-popup__close">Отмена</a>
                            <a href="#" class="modal-location__groupbtn_select">Закрепить</a>
                        </div>
                    </div>
                    <div class="tab-pane" id="tab-city">
                        <form class="modal-location__form">
                            <input type="text" name="query" value="Москва" class="modal-location__input">
                            <input type="submit" value="Закрепить" class="default_btn modal-location__submit">
                        </form>
                        <div class="modal-location__list">
                            <div class="modal-location__list_descr">Введите город поиска или выберите город из списка популярных</div>
                            <ul class="modal-location__sities">
                                <li class="modal-location__city"><a href="#" class="modal-location__city_link __bold">Москва</a></li>
                                <li class="modal-location__city"><a href="#" class="modal-location__city_link __bold __active">Санкт-Петербург</a></li>
                                <li class="modal-location__city"><a href="#" class="modal-location__city_link">Екатеринбург</a></li>
                                <li class="modal-location__city"><a href="#" class="modal-location__city_link">Краснодар</a></li>
                                <li class="modal-location__city"><a href="#" class="modal-location__city_link">Новосибирск</a></li>
                                <li class="modal-location__city"><a href="#" class="modal-location__city_link">Красноярск</a></li>
                                <li class="modal-location__city"><a href="#" class="modal-location__city_link">Челябинск</a></li>
                                <li class="modal-location__city"><a href="#" class="modal-location__city_link">Тюмень</a></li>
                                <li class="modal-location__city"><a href="#" class="modal-location__city_link">Ростов-на-Дону</a></li>
                                <li class="modal-location__city"><a href="#" class="modal-location__city_link">Уфа</a></li>
                                <li class="modal-location__city"><a href="#" class="modal-location__city_link">Казань</a></li>
                                <li class="modal-location__city"><a href="#" class="modal-location__city_link">Пермь</a></li>
                                <li class="modal-location__city"><a href="#" class="modal-location__city_link">Нижний Новгород</a></li>
                                <li class="modal-location__city"><a href="#" class="modal-location__city_link">Самара</a></li>
                                <li class="modal-location__city"><a href="#" class="modal-location__city_link">Омск</a></li>
                            </ul>
                        </div>
                        <a href="#" class="modal-location__cancel _modal-popup__close">Отмена</a>
                    </div>
                </div>
            </div>
        </div>
    </div>
    <div class="modal-popup modal-auth" style="display: none;" id="auth">
        <div class="modal-popup__content">
            <a class="modal-popup__close"></a>
            <div class="modal-auth__content">
                <div class="modal-auth__benefits">
                    <ul class="modal-auth__benefits_list">
                        <li class="modal-auth__benefits_item">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="currentColor"><path d="M20 4H4c-1.1 0-1.99.9-1.99 2L2 18c0 1.1.9 2 2 2h16c1.1 0 2-.9 2-2V6c0-1.1-.9-2-2-2zm0 4l-8 5-8-5V6l8 5 8-5v2z"></path><path d="M0 0h24v24H0z" fill="none"></path></svg>
                            <span class="modal-auth__benefits_title">Общайтесь</span>
                            <span class="modal-auth__benefits_descr">по объявлениям в чатах</span>
                        </li>
                        <li class="modal-auth__benefits_item">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="currentColor"><path d="M20 4H4c-1.1 0-1.99.9-1.99 2L2 18c0 1.1.9 2 2 2h16c1.1 0 2-.9 2-2V6c0-1.1-.9-2-2-2zm0 4l-8 5-8-5V6l8 5 8-5v2z"></path><path d="M0 0h24v24H0z" fill="none"></path></svg>
                            <span class="modal-auth__benefits_title">Размещайте</span>
                            <span class="modal-auth__benefits_descr">объявления бесплатно</span>
                        </li>
                        <li class="modal-auth__benefits_item">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="currentColor"><path d="M20 4H4c-1.1 0-1.99.9-1.99 2L2 18c0 1.1.9 2 2 2h16c1.1 0 2-.9 2-2V6c0-1.1-.9-2-2-2zm0 4l-8 5-8-5V6l8 5 8-5v2z"></path><path d="M0 0h24v24H0z" fill="none"></path></svg>
                            <span class="modal-auth__benefits_title">Покупайте со скидкой</span>
                            <span class="modal-auth__benefits_descr">по безопасной сделке</span>
                        </li>
                        <li class="modal-auth__benefits_item">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="currentColor"><path d="M20 4H4c-1.1 0-1.99.9-1.99 2L2 18c0 1.1.9 2 2 2h16c1.1 0 2-.9 2-2V6c0-1.1-.9-2-2-2zm0 4l-8 5-8-5V6l8 5 8-5v2z"></path><path d="M0 0h24v24H0z" fill="none"></path></svg>
                            <span class="modal-auth__benefits_title">Покупайте с доставкой</span>
                            <span class="modal-auth__benefits_descr">по всей России</span>
                        </li>
                        <li class="modal-auth__benefits_item">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="currentColor"><path d="M20 4H4c-1.1 0-1.99.9-1.99 2L2 18c0 1.1.9 2 2 2h16c1.1 0 2-.9 2-2V6c0-1.1-.9-2-2-2zm0 4l-8 5-8-5V6l8 5 8-5v2z"></path><path d="M0 0h24v24H0z" fill="none"></path></svg>
                            <span class="modal-auth__benefits_title">Подписывайтесь</span>
                            <span class="modal-auth__benefits_descr">на продавцов и добавляйте объявления в избранное</span>
                        </li>
                    </ul>
                </div>
                <div class="modal-auth__form">
                    <div class="modal-auth__form_title">Вход и регистрация</div>
                    <div class="modal-auth__form_descr">по номеру телефона</div>
                    <div class="modal-auth__form_input"><input class="auth__form_input_phone" type="text" name="phone" value=""></div>
                    <div class="modal-auth__form_submit"><input class="default_btn auth__form_input_submit" type="submit" value="Продолжить"></div>
                    <div class="modal-auth__social">
                        <div class="modal-auth__social_title">или через соцсети</div>
                        <ul class="modal-auth__social_list">
                            <li class="modal-auth__social_item"><a href="#" class="modal-auth__social_link __vk"><svg width="32" height="32" viewBox="0 0 32 32"><path d="M22.153 18.052s1.415 1.396 1.764 2.045c.01.013.015.026.018.033.142.238.175.423.105.562-.117.23-.517.343-.653.353h-2.5c-.174 0-.537-.045-.977-.348-.338-.237-.672-.625-.997-1.004-.485-.563-.905-1.05-1.328-1.05a.508.508 0 0 0-.158.025c-.32.104-.73.56-.73 1.777 0 .38-.3.598-.512.598H15.04c-.39 0-2.422-.136-4.222-2.035-2.203-2.325-4.186-6.988-4.203-7.031-.125-.302.133-.464.415-.464h2.525c.337 0 .447.205.523.387.09.212.42 1.053.962 2 .878 1.543 1.417 2.17 1.848 2.17a.5.5 0 0 0 .232-.06c.563-.313.458-2.322.433-2.738 0-.079-.001-.899-.29-1.292-.206-.285-.558-.393-.771-.433a.918.918 0 0 1 .331-.282c.387-.193 1.084-.222 1.775-.222h.385c.75.01.944.059 1.215.127.55.132.562.487.514 1.702-.015.345-.03.735-.03 1.195 0 .1-.005.206-.005.32-.017.618-.037 1.32.4 1.608a.36.36 0 0 0 .19.055c.151 0 .608 0 1.845-2.122a16.19 16.19 0 0 0 .991-2.123c.025-.043.099-.177.185-.228a.443.443 0 0 1 .207-.049h2.968c.324 0 .545.049.587.174.073.198-.013.803-1.368 2.638l-.605.798c-1.229 1.61-1.229 1.692.076 2.914z" fill="currentColor" fill-rule="evenodd"></path></svg></a></li>
                            <li class="modal-auth__social_item"><a href="#" class="modal-auth__social_link __ok"><svg width="32" height="32" viewBox="0 0 32 32"><path d="M15.946 16.395c-2.544-.01-4.592-2.09-4.582-4.645.01-2.557 2.074-4.658 4.623-4.686 2.567-.028 4.66 2.059 4.648 4.65-.013 2.593-2.122 4.692-4.689 4.681zm.028-6.595a1.948 1.948 0 0 0-1.922 1.94 1.912 1.912 0 0 0 1.907 1.924 1.948 1.948 0 0 0 1.932-1.94A1.908 1.908 0 0 0 15.974 9.8zm4.669 9.678a8.876 8.876 0 0 1-2.491 1.047l2.23 2.268c.493.501.49 1.303-.008 1.788a1.26 1.26 0 0 1-1.782-.03l-2.615-2.67-2.615 2.586c-.243.24-.41.279-.559.344l-.316.008a1.23 1.23 0 0 1-.87-.38 1.255 1.255 0 0 1 .005-1.762l2.193-2.182a8.766 8.766 0 0 1-2.489-1.095 1.398 1.398 0 0 1-.422-1.91 1.357 1.357 0 0 1 1.89-.424 5.98 5.98 0 0 0 6.367.027 1.403 1.403 0 1 1 1.482 2.385z" fill="currentColor" fill-rule="evenodd"></path></svg></a></li>
                        </ul>
                    </div>
                    <a href="#" class="modal-auth__login">У меня есть логин и пароль</a>
                </div>
            </div>
        </div>
    </div>

    <?php $this->endBody() ?>
    </body>
    </html>
<?php $this->endPage() ?>